---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalLinkType
source: html/7d3bcda4-4498-11e8-b680-a461ca5b235e.htm
---
# AnalyticalLinkType Properties

The id of the assembly instance to which the element belongs.